#Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. Определите минимальное
#число монеток, которые нужно перевернуть, чтобы все монетки были повернуты вверх одной и той же стороной. 
#Выведите минимальное количество монет, которые нужно перевернуть.

import random

n = int(input('Введите количество монет: '))
print(f"Бросаем {n} монет")
monets = []
orel = 0
reshka = 0
for i in range(0,n):
    monets.append(random.randint(0,1))
    if monets[i] == 1:
        orel +=1
    else:
        reshka +=1

print(monets)

if orel > reshka:
    print(f"Нужно перевернуть {reshka} монет(ы)")
else:
    print(f"Нужно перевернуть {orel} монет(ы)")