#Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике.
#Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для этого Петя делает две подсказки.
#Он называет сумму этих чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа.
import math

s = int(input('Петя называт сумму чисел: '))
p = int(input('Петя называт произведение чисел: '))

print('Катя думает...')

Discr = (s*s)-4*p

print (Discr)

if (Discr < 0):
    print('Петя обманывает Катю, таких чисел нет')
if (Discr == 0):
    print(f"X = {(s/2)}, Y = {s-(s/2)}")
if (Discr > 0):
    print('Катя может огадать только натуральные числа(')
    #print(f"Y1 = {(-s+math.sqrt(Discr))/(-2)}, X1 = {s-((-s+math.sqrt(Discr))/(-2))}")
    